// @flow

import React from 'react';
import { withNavigation } from 'react-navigation';
import {
  Body,
  Button as NBButton,
  Container,
  Content,
  Icon as NBIcon,
  Left,
  Right,
  Title,
} from 'native-base';
import Markdown from 'react-native-markdown-renderer';

import { Header } from '../components';

import colors from '../config/colors';

const raw = `_Onova - Nov 20, 2018_

Гроші за товар від покупця до продавця потрапляють без розголошення даних банківських карт і тільки в тому випадку, якщо товар після огляду буде отримано покупцем. Доставка відбувається з відділення до відділення Нова Пошта (адресна доставка не передбачена).

Для активації продажів продавець має в налаштуваннях вказати:

- дані відправника (ПІБ, телефон);
- місто і відділення Нова Пошта, з якого буде відправлений товар;
- номер банківської карти, на яку будуть зараховані гроші за товар.

При оплаті товару покупцеві на розрахунковий контактний номер буде надіслано SMS-повідомлення з тимчасовим паролем (3D secure) від банку-емітента платіжної картки. Сервісні листи направляються тільки з домена onova.co. Інші комунікації не здійснюються.
Інші листи, SMS-повідомлення, особисті повідомлення можуть бути відправлені недоброзичливцями / шахраями. Проводьте продажі і покупки тільки через профіль Onova.

### Купівля товару

Покупець, вибравши товар, натискає кнопку "Придбати". В процесі оформлення покупки покупець вибирає відділення Нова Пошта, в якому він готовий забрати свій товар, вказує дані банківської картки для оплати, а саме: номер, термін дії, CVV код.

Покупець оплачує вартість товару і доставки (комісію фінансовому партнеру за проведення транзакції переказу грошей з картки на картку та комісію Onova сплачує продавець при успішній покупці) . Залежно від типу карти деякі банки можуть стягувати додаткову комісію: з покупця - за переказ коштів, з продавця - за зарахування коштів на рахунок. Гроші за товар не перераховуються продавцю відразу, вони блокуються на транзитному рахунку нашого фінансового партнера компанії UAPAY. Безпека цієї операції гарантована компанією UAPAY. UAPAY відповідає стандартам інформаційної безпеки PCI DSS 3.2 і гарантує повну безпеку зберігання даних.

### Підтвердження угоди

Після того, як покупець оформить покупку, продавець отримує повідомлення. У продавця є 48 годин на те, щоб прийняти або відхилити угоду в профілі Onova. У разі, якщо угода буде відхилена продавцем, або він не підтвердить її протягом 48-ми годин, угода буде анульована. Гроші за товар і вартість доставки повернуться на карту покупця.

### Відправка товару покупцеві

Після підтвердження угоди в профілі Onova, у продавця є 2 робочих дні на відправку товару. Якщо цього не відбувається, угода анулюється, гроші за товар повернуться на карту покупця протягом 5-6 днів (без урахування дня покупки, неділі та святкових). Для повернення суми доставки може знадобитися додатково до 3 робочих днів.

Для того щоб відправити товар, продавець повинен надати номер створеної електронної накладної оператору Нова Пошта (накладна вказана в профілі Onova) і принести посилку в відділення, вказане їм при розміщенні оголошення (адресна доставка не передбачена). Для надійного транспортування посилки, може знадобиться додаткова упаковка. Упаковку посилки завжди сплачує продавець, окремим чеком у відділенні Нова Пошта.

Доставка посилки відбувається в місто і відділення одержувача, вказане при оформленні послуги. Переадресація і перенаправлення експрес-накладних заборонені.

### Отримання посилки

У момент надходження до відділення Нова Пошта, посилка очікує одержувача 5-ть днів. Отримуючи товар, покупець обов'язково повинен оглянути його. Якщо товар підійшов, покупець забирає посилку, гроші за товар зараховуються на карту продавця. Якщо товар не підійшов, покупець відмовляється від отримання, йому на карту повертаються гроші за товар (вартість доставки не повертається). Комісія фінансового партнера при успішній завершеній покупці за проведення транзакції переказу грошових коштів з карти, стягується з карти продавця автоматично. Повернення товару, який не підійшов покупцеві, буде оформлений продавцеві на 5 день.

Якщо покупець не прийшов у відділення за товаром, на 5-й день

Буде автоматично оформлене повернення посилки продавцю. Покупцеві на карту в цьому випадку буде повернуто вартість товару (вартість доставки не повертається). Комісія фінансового партнера за проведення транзакції переказу грошових коштів з карти, за умовами акції, повертається на карту покупця протягом 24 годин. Якщо продавець не забрав товар, який був відправлений йому назад, протягом 25-ти днів, посилка передається на утилізацію.

Після отримання або відмови від товару у відділенні Нова Пошта, угода вважається закритою і всі розбіжності за такою угодою вирішуються безпосередньо між продавцем і покупцем. Onova, UAPAY і Нова Пошта не беруть участі в спорах, що виникають між продавцем і покупцем за закритими операціями.

## Умови оплати

Усі розрахунки відбуваються виключно в межах додатку через фінансового партнера UAPAY. Розрахунки за межами додатку заборонені.

Комісія фінансовому партнеру за проведення транзакції переказу грошей з картки на картку становить 10% від вартості товару + 10 грн при вартості товару менше 1000грн та 5% від вартості товару + 10 грн при вартості товару більше 1000грн.
Доставка оплачується покупцем. Користуючись послугою, покупець і продавець погоджуються з умовами публічних договорів, умовами угоди на обробку своїх персональних даних, умовами надання послуг логістичним партнером і публічним договором Нова Пошта, а також приймає Правила послуги Onova Доставка.

ТОВ ОНОВА не зберігає і не передає дані платіжних карт Користувачів. Інформація за платіжними відомостями Користувачів вводиться на захищеній сторінці UAPAY, що відповідає стандартам інформаційної безпеки PCI DSS 3.2 і гарантує повну безпеку даних Користувачів.

## Порядок розгляду скарг

При виникненні питань звертайтесь у службу підтримки Onova за тел [\(063\) 419-75-03](tel:0634197503) або в службу підтримки UAPAY за тел [\(044\) 364-11-44](tel:0443641144)

Надсилати скарги можна за електронною поштовою адресою [support@onova.co](mailto:support@onova.co)

Для власників платіжних карт для письмових звернень використовуйте адресу м.Львів 79000, вул. Героїв УПА 7-18

Скарги розглядатимуться з Понеділка по П'ятницю з 10ї до 18ї години.
`;
class MarkdownDoc extends React.Component {
  render() {
    return (
      <Container>
        <Header>
          <Left style={{ flex: 1 }}>
            <NBButton
              transparent
              dark
              onPress={() => this.props.navigation.goBack()}>
              <NBIcon ios="ios-arrow-back" android="md-arrow-back" />
            </NBButton>
          </Left>
          <Body
            style={{
              flex: 5,
              justifyContent: 'center',
              alignItems: 'stretch',
            }}>
            <Title style={{ color: colors.black }}>
              Офіційні правила безпечної угоди
            </Title>
          </Body>
          <Right />
        </Header>
        <Content contentContainerStyle={{ paddingHorizontal: 20 }}>
          <Markdown style={{ text: { color: colors.black } }}>{raw}</Markdown>
        </Content>
      </Container>
    );
  }
}

export default withNavigation(MarkdownDoc);
